[
  {
    "key": 1,
    "images": "/images/whoweare.jpg",
    "alts": "who we are",
    "titles": "About Us",
    "projectDescription": "Oromo Evangelical Church of Toronto (OECT) formerly known as 'The Oromo Christian Church of Toronto' was initiated in the early 1990s as a fellowship by Oromo immigrants to Canada residing in the Greater Toronto Area (GTA) and surrounding cities who committed themselves to worship God in their mother-tongue (Afaan Oromoo) to bring a holistic impact in the lives of their communities living in Oromia and abroad. newline A few years later, the fellowship grew, and this group of Christians came together and agreed to adopt a constitution and transform the fellowship into a more formal establishment."
  },
  {
    "key": 2,
    "images": "/images/vision.jpg",
    "alts": "church vision",
    "titles": "Vision",
    "projectDescription": "Oromo Evangelical Church of Toronto is envisioned to create a vibrant and growing community of faith that shares the blessings of the Christian life with a tender and generous heart."
  },
  {
    "key": 3,
    "images": "/images/mission.jpg",
    "alts": "church Mission",
    "titles": "Mission",
    "projectDescription": "OECT aspires to be a welcoming tabernacle that supports members to grow in their spiritual life and show a strong commitment to spreading the living word of God to communities in the GTA area and across the boundaries. newline We wish to be a congregation that fulfills a ministry of hospitality, welcoming, and nurturing to all those who are in need. We hope to be a caring, spiritually vigorous church where members' faith and life intersect."
  },
  {
    "key": 4,
    "images": "/images/values.jpg",
    "alts": "Core Values",
    "titles": "Core Values",
    "projectDescription": "OECT core values are embedded in: Faith: We believe that God makes the impossible possible beyond what we can see. newline Love: We believe in unconditional love for one another as Christ loves us. newline Unity: We endeavor to build a genuine relationship with all and stand together as one body. newline Mercy: We forgive as Jesus has forgiven us. newline Growth: We continuously grow in our faith and unity with God. newline Integrity: We are a growing body of Christ as proclaimed in the scripture. newline Servanthood: We strive to live our ambitions and attitudes with our actions. newline Generosity: We unreservedly give to build the house of the lord. newline Partnership: We partner with and support sister churches who share our vision of making people disciples of Jesus Christ. newline Transparency: All members have equal rights and access to know the status of the resources and services held in the church. newline Outreach: We reach out to all nations with the good news (gospel)."
  },
  {
    "key": 5,
    "images": "/images/goal.jpg",
    "alts": "Purpose/Goal",
    "titles": "Purpose/Goal",
    "projectDescription": "1. To proclaim the Holy word of God to the lost, teach/guide/support them to repent and believe in Lord Jesus Christ and become his disciples. (John 1:29), (Acts 2:38), (Matthew 28:19-20); promulgate the Gospel of the Lord Jesus Christ by all scriptural means (Colossians 1:28).newline 2. To build and maintain a place of worship (House for God), and care for the Church of God (1 Corinthians 3:16-17, 1 Kings 8:17-18, Acts 20:28).newline \n3. To assemble and reinforce bonds of Christian fellowship and worship God in spirit and truth, and learn from the living word of God, the Bible (John 4:24, Romans 12:10).newline 4. To grow together and become mature Christians (1 Samuel 2:26, 2 Peter 3:18).newline 5. To set and solidify the rules of Christian conduct based on biblical truth (Titus 2)."
  } 

]